USE UniversityDB;

-- 1. Преподаватели
INSERT IGNORE INTO Teachers (first_name, last_name, middle_name, birth_date, email, phone, hire_date)
VALUES 
('Иван', 'Петров', 'Сергеевич', '1980-05-12', 'petrov@example.com', '+79991234567', '2015-09-01'),
('Анна', 'Сидорова', 'Ивановна', '1985-03-20', 'sidorova@example.com', '+79997654321', '2018-02-15'),
('Михаил', 'Кузнецов', 'Алексеевич', '1975-11-08', 'kuznetsov@example.com', '+79991112233', '2010-01-10');

-- 2. Предметы 
INSERT IGNORE INTO Subjects (subject_name, is_math_related)
VALUES 
('Математика', TRUE),
('Физика', TRUE),
('Русский язык', FALSE),
('История', FALSE);

-- 3. Курсы
INSERT IGNORE INTO Courses (subject_id, teacher_id, academic_year, semester)
VALUES 
(1, 1, '2024-2025', 1),  -- 1: Математика Петров
(2, 1, '2024-2025', 1),  -- 2: Физика Петров
(3, 2, '2024-2025', 1),  -- 3: Русский Сидорова
(4, 3, '2024-2025', 1),  -- 4: История Кузнецов
(1, 2, '2024-2025', 2),  -- 5: Математика Сидорова
(3, 2, '2023-2024', 2);  -- 6: Русский Сидорова в прошлом году

-- 4. Студенты
INSERT IGNORE INTO Students (first_name, last_name, middle_name, birth_date, email, phone, enrollment_date, group_name)
VALUES 
('Алексей', 'Смирнов', 'Викторович', '2002-07-14', 'smirnov@example.com', '+79995556677', '2023-09-01', 'ИТ-23'),
('Екатерина', 'Васильева', 'Андреевна', '2003-02-25', 'vasilieva@example.com', '+79994443322', '2023-09-01', 'МТ-23'),
('Дмитрий', 'Орлов', 'Павлович', '2001-10-30', 'orlov@example.com', '+79992221100', '2022-09-01', 'ИТ-22');

-- 5. Связи студент-курс
INSERT IGNORE INTO StudentCourses (student_id, course_id)
VALUES 
(1, 1), (1, 2), (1, 3), (1, 4), (1, 6),  -- Смирнов
(2, 1), (2, 3), (2, 5),                 -- Васильева
(3, 1), (3, 2), (3, 4);                 -- Орлов

-- 6. Оценки
INSERT IGNORE INTO Grades (student_id, course_id, teacher_id, grade, grade_date)
VALUES 
(1, 1, 1, 5, '2025-01-15'),  -- Мат. Петров
(1, 2, 1, 4, '2025-02-10'),  -- Физ. Петров
(1, 3, 2, 3, '2025-03-05'),  -- Рус. Сидорова
(1, 4, 3, 2, '2025-04-20'),  -- История Кузнецов
(1, 6, 2, 4, '2024-06-01'),  -- Прошлогодний Рус. (для динамики)
(2, 1, 1, 5, '2025-01-16'),  -- Мат. Петров
(2, 3, 2, 5, '2025-03-06'),  -- Рус. Сидорова
(2, 5, 2, 4, '2025-05-10'),  -- Мат. Сидорова
(3, 1, 1, 3, '2025-01-17'),  -- Мат. Петров
(3, 2, 1, 4, '2025-02-11'),  -- Физ. Петров
(3, 4, 3, 5, '2025-04-21');  -- История Кузнецов
